[
  {
    "reference": "Romans 8:28",
    "tradition": "reformed",
    "author": "John Calvin",
    "source": "Commentary on Romans",
    "year": 1540,
    "text": "We know that all things work together for good for those who love God. This passage teaches us that God's providence extends over all things, and that even adversities are turned to the benefit of believers. The 'good' here is not temporal prosperity, but spiritual and eternal good - our conformity to Christ and ultimate glorification."
  },
  {
    "reference": "Romans 8:28",
    "tradition": "patristic",
    "author": "Augustine of Hippo",
    "source": "On the Predestination of the Saints",
    "year": 428,
    "text": "Those who are called according to His purpose are predestined to be conformed to the image of His Son. God works all things together for good, not because all things are good in themselves, but because God in His sovereign grace causes them to work for the good of His elect."
  },
  {
    "reference": "John 3:16",
    "tradition": "reformed",
    "author": "Charles Spurgeon",
    "source": "Metropolitan Tabernacle Pulpit",
    "year": 1880,
    "text": "God so loved the world - not a select few, not merely the nation of Israel, but the world. Yet this love is effectual only in those who believe. The gift of the Son is universal in its offer, but particular in its application. Whosoever believes shall not perish, and this belief is itself a gift of grace."
  },
  {
    "reference": "John 3:16",
    "tradition": "patristic",
    "author": "John Chrysostom",
    "source": "Homilies on John",
    "year": 390,
    "text": "See how the Son is given. Not by compulsion, not by necessity, but willingly. The Father gave Him, and the Son gave Himself. This is the wonder of God's love - that He should give His own Son for those who were His enemies. And what is required? Only faith, only to believe on Him."
  },
  {
    "reference": "Ephesians 2:8-9",
    "tradition": "reformed",
    "author": "Martin Luther",
    "source": "Commentary on Galatians",
    "year": 1535,
    "text": "For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works. This passage demolishes all human merit. Salvation is wholly of grace, faith is the instrument, and even faith itself is God's gift. No room remains for boasting or self-righteousness."
  },
  {
    "reference": "Ephesians 2:8-9",
    "tradition": "patristic",
    "author": "Jerome",
    "source": "Commentary on Ephesians",
    "year": 387,
    "text": "Grace and faith are both gifts of God. We cannot even believe unless God first gives us the ability to believe. The faith by which we are saved is not generated from within ourselves, but is poured into us from heaven. All is of grace, from beginning to end."
  }
]
