[
  {
    "reference": "Matthew 1",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew I]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. I. This evangelist begins with the account of Christ's parentage and birth, the ancestors from whom he descended, and the manner of his entry into the world, to make it appear that he was indeed the Messiah promised, for it was foretold that he should be the son of David, and should be born of a virgin; and that he was so is here plainly shown; for here is, I. His pedigree from Abraham in forty-two generations, three fourteens, ver. 1-17 . II. An account of the circumstances of his birth, so far as was requisite to show that he was born of a virgin, ver. 18-25 . Thus methodically is the life of our blessed Saviour written, as lives should be written, for the clearer proposing of the example of them. The Genealogy of Christ. 1 The book of the generation of Jesus Christ, the son of David, the son of Abraham. 2 Abraham begat Isaac; and Isaac begat Jacob; and Jacob begat Judas and his brethren; 3 And Judas begat Phares and Zara of Thamar; and Phares begat Esrom; and Esrom begat Aram; 4 And Aram begat Aminadab; and Aminadab begat Naasson; and Naasson begat Salmon; 5 And Salmon begat Booz of Rachab; and Booz begat Obed of Ruth; and Obed begat Jesse; 6 And Jesse begat David the king; and David the king begat Solomon of her that had been the wife of Urias; 7 And Solomon begat Roboam; and Roboam begat Abia; and Abia begat Asa; 8 And Asa begat Josaphat; and Josaphat begat Joram; and Joram begat Ozias; 9 And Ozias begat Joatham; and Joatham begat Achaz; and Achaz begat Ezekias; 10 And Ezekias begat Manasses; and Manasses begat Amon; and Amon begat Josias; 11 And Josias begat Jechonias and his brethren, about the time they were carried away to Babylon: 12 And after they were brought to Babylon, Jechonias begat S"
  },
  {
    "reference": "Matthew 2",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew II]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. II. In this chapter, we have the history of our Saviour's infancy, where we find how early he began to suffer, and that in him the word of righteousness was fulfilled, before he himself began to fulfil all righteousness. Here is, I. The wise men's solicitous enquiry after Christ, ver. 1-8 . II. Their devout attendance on him, when they found out where he was, ver. 9-12 . III. Christ's flight into Egypt, to avoid the cruelty of Herod, ver. 13-15 . IV. The barbarous murder of the infants of Bethlehem, ver. 16-18 . V. Christ's return out of Egypt into the land of Israel again, ver. 19-23 . The Wise Men Come to Jerusalem. 1 Now when Jesus was born in Bethlehem of Judea in the days of Herod the king, behold, there came wise men from the east to Jerusalem, 2 Saying, Where is he that is born King of the Jews? for we have seen his star in the east, and are come to worship him. 3 When Herod the king had heard these things, he was troubled, and all Jerusalem with him. 4 And when he had gathered all the chief priests and scribes of the people together, he demanded of them where Christ should be born. 5 And they said unto him, In Bethlehem of Judea: for thus it is written by the prophet, 6 And thou Bethlehem, in the land of Juda, art not the least among the princes of Juda: for out of thee shall come a Governor, that shall rule my people Israel. 7 Then Herod, when he had privily called the wise men, enquired of them diligently what time the star appeared. 8 And he sent them to Bethlehem, and said, Go and search diligently for the young child; and when ye have found him, bring me word again, that I may come and worship him also. It was a mark of humiliation put upon the Lord Jesus that, though he was the Desire "
  },
  {
    "reference": "Matthew 3",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew III]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. III. At the start of this chapter, concerning the baptism of John, begins the gospel ( Mark i. 1 ); what went before is but preface or introduction; this is \"the beginning of the gospel of Jesus Christ.\" And Peter observes the same date, Acts i. 22 , beginning from the baptism of John, for then Christ began first to appear in him, and then to appear to him, and by him to the world. Here is, I. The glorious rising of the morning-star--John the Baptist, ver. 1 . 1. The doctrine he preached, ver. 2 . 2. The fulfilling of the scripture in him, ver. 3 . 3. His manner of life, ver. 4 . 4. The resort of multitudes to him, and their submission to his baptism, ver. 5, 6 . 5. His sermon that he preached to the Pharisees and Sadducees, wherein he endeavours to bring them to repentance ( ver. 7-10 ), and so to bring them to Christ, ver. 11, 12 . II. The more glorious shining forth of the Sun of righteousness, immediately after: where we have, 1. The honour done by him to the baptism of John, ver. 13-15 . 2. The honour done to him by the descent of the Spirit upon him, and a voice from heaven, ver. 16, 17 . The Preaching of John the Baptist. 1 In those days came John the Baptist, preaching in the wilderness of Judea, 2 And saying, Repent ye: for the kingdom of heaven is at hand. 3 For this is he that was spoken of by the prophet Esaias, saying, The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight. 4 And the same John had his raiment of camel's hair, and a leathern girdle about his loins; and his meat was locusts and wild honey. 5 Then went out to him Jerusalem, and all Judea, and all the region round about Jordan, 6 And were baptized of him in Jordan, confessing the"
  },
  {
    "reference": "Matthew 4",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew IV]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. IV. John Baptist said concerning Christ, He must increase, but I must decrease; and so it proved. For, after John had baptized Christ, and borne his testimony to him, we hear little more of his ministry; he had done what he came to do, and thenceforward there is as much talk of Jesus as ever there had been of John. As the rising Sun advances, the morning star disappears. Concerning Jesus Christ we have in this chapter, I. The temptation he underwent, the triple assault the tempter made upon him, and the repulse he gave to each assault, ver. 1-11 . II. The teaching work he undertook, the places he preached in ( ver. 12-16 ), and the subject he preached on, ver. 17 . III. His calling of disciples, Peter and Andrew, James and John, ver. 18-22 . IV. His curing diseases ( ver. 23, 24 ), and the great resort of the people to him, both to be taught and to be healed. The Temptation of Christ. 1 Then was Jesus led up of the Spirit into the wilderness to be tempted of the devil. 2 And when he had fasted forty days and forty nights, he was afterward an hungred. 3 And when the tempter came to him, he said, If thou be the Son of God, command that these stones be made bread. 4 But he answered and said, It is written, Man shall not live by bread alone, but by every word that proceedeth out of the mouth of God. 5 Then the devil taketh him up into the holy city, and setteth him on a pinnacle of the temple, 6 And saith unto him, If thou be the Son of God, cast thyself down: for it is written, He shall give his angels charge concerning thee: and in their hands they shall bear thee up, lest at any time thou dash thy foot against a stone. 7 Jesus said unto him, It is written again, Thou shalt not tempt the Lord thy God."
  },
  {
    "reference": "Matthew 5",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew V]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. V. This chapter, and the two that follow it, are a sermon; a famous sermon; the sermon upon the mount. It is the longest and fullest continued discourse of our Saviour that we have upon record in all the gospels. It is a practical discourse; there is not much of the credenda of Christianity in it--the things to be believed, but it is wholly taken up with the agenda--the things to be done; these Christ began with in his preaching; for if any man will do his will, he shall know of the doctrine, whether it be of God. The circumstances of the sermon being accounted for ( ver. 1, 2 ), the sermon itself follows, the scope of which is, not to fill our heads with notions, but to guide and regulate our practice. I. He proposes blessedness as the end, and gives us the character of those who are entitled to blessedness (very different from the sentiments of a vain world), in eight beatitudes, which may justly be called paradoxes, ver. 3-12 . II. He prescribes duty as the way, and gives us standing rules of that duty. He directs his disciples, 1. To understand what they are--the salt of the earth, and the lights of the world, ver. 13-16 . 2. To understand what they have to do--they are to be governed by the moral law. Here is, (1.) A general ratification of the law, and a recommendation of it to us, as our rule, ver. 17-20 . (2.) A particular rectification of divers mistakes; or, rather, a reformation of divers wilful, gross corruptions, which the scribes and Pharisees had introduced in their exposition of the law; and an authentic explication of divers branches which most needed to be explained and vindicated, ver. 20 . Particularly, here is an explication, [1.] Of the sixth commandment, which forbids murder, v"
  },
  {
    "reference": "Matthew 6",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew VI]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. VI. Christ having, in the former chapter, armed his disciples against the corrupt doctrines and opinions of the scribes and Pharisees, especially in their expositions of the law (that was called their leaven, ch. xvi. 12 ), comes in this chapter to warn them against their corrupt practices, against the two sins which, though in their doctrine they did not justify, yet in their conversation they were notoriously guilty of, and so as even to recommend them to their admirers: these were hypocrisy and worldly-mindedness, sins which, of all others, the professors of religion need most to guard against, as sins that most easily beset those who have escaped the grosser pollutions that are in the world through lust, and which are therefore highly dangerous. We are here cautioned, I. Against hypocrisy; we must not be as the hypocrites are, nor do as the hypocrites do. 1. In the giving of alms, ver. 1-4 . 2. In prayer, ver. 5-8 . We are here taught what to pray for, and how to pray ( ver. 9-13 ); and to forgive in prayer, ver. 14, 15 . 3. In fasting, ver. 16-18 . II. Against worldly-mindedness, 1. In our choice, which is the destroying sin of hypocrites, ver. 19-24 . 2. In our cares, which is the disquieting sin of many good Christians, ver. 25-34 . The Sermon on the Mount. 1 Take heed that ye do not your alms before men, to be seen of them: otherwise ye have no reward of your Father which is in heaven. 2 Therefore when thou doest thine alms, do not sound a trumpet before thee, as the hypocrites do in the synagogues and in the streets, that they may have glory of men. Verily I say unto you, They have their reward. 3 But when thou doest alms, let not thy left hand know what thy right hand doeth: 4 That thine a"
  },
  {
    "reference": "Matthew 7",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew VII]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. VII. This chapter continues and concludes Christ's sermon on the mount, which is purely practical, directing us to order our conversation aright, both toward God and man; for the design of the Christian religion is to make men good, every way good. We have, I. Some rules concerning censure and reproof, ver. 1-6 . II. Encouragements given us to pray to God for what we need, ver. 7-11 . III. The necessity of strictness in conversation urged upon us, ver. 12-14 . IV. A caution given us to take heed of false prophets, ver. 15-20 . V. The conclusion of the whole sermon, showing the necessity of universal obedience to Christ's commands, without which we cannot expect to be happy, ver. 21-27 . VI. The impression which Christ's doctrine made upon his hearers, ver. 28, 29 . The Sermon on the Mount. 1 Judge not, that ye be not judged. 2 For with what judgment ye judge, ye shall be judged: and with what measure ye mete, it shall be measured to you again. 3 And why beholdest thou the mote that is in thy brother's eye, but considerest not the beam that is in thine own eye? 4 Or how wilt thou say to thy brother, Let me pull out the mote out of thine eye; and, behold, a beam is in thine own eye? 5 Thou hypocrite, first cast out the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother's eye. 6 Give not that which is holy unto the dogs, neither cast ye your pearls before swine, lest they trample them under their feet, and turn again and rend you. Our Saviour is here directing us how to conduct ourselves in reference to the faults of others; and his expressions seem intended as a reproof to the scribes and Pharisees, who were very rigid and severe, very magisterial and s"
  },
  {
    "reference": "Matthew 8",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew VIII]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. VIII. The evangelist having, in the foregoing chapters, given us a specimen of our Lord's preaching, proceeds now to give some instances of the miracles he wrought, which prove him a Teacher come from God, and the great Healer of a diseased world. In this chapter we have, I. Christ's cleansing of a leper, ver. 1-4 . II. His curing a palsy and fever, ver. 5-18 . III. His communing with two that were disposed to follow him, ver. 19-22 . IV. His controlling the tempest, ver. 23-27 . V. His casting out devils, ver. 28-34 . The Leper Healed. 1 When he was come down from the mountain, great multitudes followed him. 2 And, behold, there came a leper and worshipped him, saying, Lord, if thou wilt, thou canst make me clean. 3 And Jesus put forth his hand, and touched him, saying, I will; be thou clean. And immediately his leprosy was cleansed. 4 And Jesus saith unto him, See thou tell no man; but go thy way, show thyself to the priest, and offer the gift that Moses commanded, for a testimony unto them. The first verse refers to the close of the foregoing sermon: the people that heard him were astonished at his doctrine; and the effect was, that when he came down from the mountain, great multitudes followed him; though he was so strict a Lawgiver, and so faithful a Reprover, they diligently attended him, and were loth to disperse, and go from him. Note, They to whom Christ has manifested himself, cannot but desire to be better acquainted with him. They who know much of Christ should covet to know more; and then shall we know, if we thus follow on to know the Lord. It is pleasing to see people so well affected to Christ, as to think they can never hear enough of him; so well affected to the best things, as t"
  },
  {
    "reference": "Matthew 9",
    "tradition": "reformed",
    "author": "Matthew Henry",
    "source": "Commentary on the Whole Bible",
    "year": 1706,
    "text": "Matthew Henry's Complete Commentary on the Whole Bible [Matthew IX]. Matthew Henry's Complete Commentary on the Whole Bible Back to Biblesnet.com Home Page [ Table of Contents ] [ Previous ] [ Next ] Matthew Henry Commentary on the Whole Bible (1721) M A T T H E W. CHAP. IX. We have in this chapter remarkable instances of the power and pity of the Lord Jesus, sufficient to convince us that he is both able to save to the uttermost all that come to God by him, and as willing as he is able. His power and pity appear here in the good offices he did, I. To the bodies of people, in curing the palsy ( ver. 2-8 ); raising to life the ruler's daughter, and healing the bloody issue ( ver. 18-26 ); giving sight to two blind men ( ver. 27-31 ); casting the devil out of one possessed ( ver. 32-34 ); and healing all manner of sickness, ver. 35 . II. To the souls of people; in forgiving sins ( ver. 2 ); calling Matthew, and conversing freely with publicans and sinners ( ver. 9-13 ); considering the frame of his disciples, with reference to the duty of fasting ( ver. 14-17 ); preaching the gospel, and, in compassion to the multitude, providing preachers for them, ver. 35-38 . Thus did he prove himself to be, as undoubtedly he is, the skilful, faithful Physician, both of soul and body, who has sufficient remedies for all the maladies of both: for which we must, therefore, apply ourselves to him, and glorify him both with our bodies and with our spirits, which are his, in return to him for his kindness to both. Christ Heals a Man Sick of the Palsy. 1 And he entered into a ship, and passed over, and came into his own city. 2 And, behold, they brought to him a man sick of the palsy, lying on a bed: and Jesus seeing their faith said unto the sick of the palsy; Son, be of good cheer; thy sins be forgiven thee. 3 And, behold, certain of the scribes said within themselves, This man blasphemeth. 4 And Jesus knowing their thoughts said, Wherefore think ye evil in your hearts? 5 For whether i"
  }
]